{
  "dishes": [
    {
      "name": "Noodles",
      "type": "Vegetarian",
      "ingredients": "1 packet store-bought noodles\n2 onions, sliced\n1 large or 2 medium spring onion, chopped\n5-6 garlic bulbs, minced or chopped\nVegetable oil for cooking\nOlive oil for dressing\nSalt to taste\nBlack pepper powder to taste\n2 tbsp tomato sauce\n1 tbsp red chilli sauce\n1-2 green chilli, chopped\n1 tsp soy sauce\n1 tsp vinegar\nSpring onion greens for garnishing\n",
      "description": "1. Cook noodles according to the packaging instructions. Meanwhile, chop onions and garlic.\n2. Heat oil in a pan, saute garlic till its raw smell goes away. Add chopped green chilli, chopped spring onions, and onion slices and saute for a couple of minutes till the onions turns soft.\n3. Add tomato sauce, chilli sauce, salt and black pepper and mix well. Stir for about a minute.\n4. Add boiled noodles, soy sauce and vinegar. Mix with the rest of the ingredients and let it cook for 1-2 minutes.\n5. Turn off the gas, drizzle some olive oil and garnish with spring onion greens. Serve hot.\n",
      "image": "image01.jpg"
    },
    {
      "name": "Fried Rice",
      "type": "Vegetarian",
      "ingredients": "1 cup basmati rice\n 1 tsp  oil\n½ tsp salt\nwater\n2 tbsp oil\n2 clove garlic (finely chopped)\n½ onion (finely chopped)\n4 tbsp spring onion (chopped)\n¼ carrot (finely chopped)\n2 tbsp cabbage (finely chopped)\n2 tbsp peas / matar\n5 beans (chopped)\n¼ capsicum (finely chopped)\n¾ tsp salt\n2 tbsp soy sauce\n1 tbsp vinegar\n1 tsp pepper (crushed)\n¼ tsp salt\n",
      "description": " 1. Firstly, in a large kadai heat 2 tbsp oil and stir-fry 2 clove garlic.\n2. Also, saute ½ onion and 2 tbsp spring onion until they sweat.\n3. Furthermore add vegetables of your choice like ¼ carrot, 2 tbsp cabbage, 2 tbsp peas, 5 beans, ¼ capsicum and ½ tsp salt.\n4. Stir fry on high flame without overcooking vegetables.\n5. Now add 2 tbsp soy sauce and 1 tbsp vinegar. stir-fry until the sauce is combined well.\n6. Keeping the flame on high, add cooked rice.\n7. Also, add 1 tsp pepper and ¼ tsp salt. adjust the salt as soy sauce has salt.\n8. Stir fry by mixing well making sure rice grains will not break.\n9. Further, add 2 tbsp spring onions and mix well.\n10. Finally, enjoy veg fried rice with gobi manchurian.\n",
      "image": "image02.jpg"
    },
    {
      "name": "Idli and Vada",
      "type": "Vegetarian",
      "ingredients": "Idli-\n1 cup urad dal\n2 cup idli rava / rice rava / cream of rice\n1 tsp salt\noil to grease\nVada-\n1 cups of urad dal or uddina bele\n¼ cup of channa dal or kadle bele\n2 tsp of rice flour\n2 green chillies\n3 tbsp of dry chopped coconut\nfew curry leaves\n1 tbsp coriander leaves (chopped)\n1 inch ginger (finely chopped))\npinch of hing\nsalt to taste\noil to fry\n",
      "description": "Idli-\n1. Firstly, in a large bowl soak 1 cup urad dal for 4 hours.\n2. Drain off the water and transfer to blender or grinder.\n3. Blend to smooth and fluffy batter adding water as required.\n4. Transfer the batter to a large bowl. keep aside.\n5. Now in another bowl take 2 cup idli rava.\n6. Rinse the idli rava with enough water and drain off the water.\n7. Repeat this for 2 or 3 times or till water runs clean.\n8. Squeeze off water from idli rava and add to urad dal batter.\n9. Mix well making sure rava and urad dal are combined well.\n10. Now cover and rest in warm place for 8-10 hours or till the batter ferments and doubles.\n11. After 8 hours, batter doubles indicating well fermented with air pockets present.\n12. Add 1 tsp salt to the batter and mix gently without disturbing the air pockets.\n13. Scoop the batter into idli plate greased with oil.\n14. Place in steamer and steam for 10 minutes on medium flame or till a toothpick inserted comes out clean.\n15. Finally, soft idli recipe are ready to serve along with chutney and sambar.\n\nVada-\n1. Wash and soak dal in about 3 cups of water for about 2-3 hours.\n2. Drain all the water from soaked dal. grind urad dal and channa dal together to smooth paste using very little water. i have used authentic grinding stone, but wet grinder or even mixer grinder can be used.\n3. The batter should be thick and use very little water. the right consistency is very important or otherwise, you will not be able to get the vada shape.\n4. Add coriander, green chilli, ginger and chopped dry coconut to the batter. mix it very well.\n5. Add 2-3 tsp of rice flour. rice flour is added to make it crispy.\n6. Add pinch of hing to make it more digestible.\n7. Heat the oil in a frying pan in medium flame. wet your palms and take a lemon size batter.\n8. Make hole in the center and slide it into the hot oil.\n9. The vada should float on top of oil.\n10. Make sure your oil is not too hot. otherwise the vadas would not cook evenly.\n11. Fry on both sides till it becomes golden brown in colour.\n12. Serve medu vada immediately with chutney collections or sambar collections.\n",
      "image": "image03.jpg"
    },
    {
      "name": "Paneer Tikka",
      "type": "Vegetarian",
      "ingredients": "½ cup curd / yogurt (thick)\n½ tsp turmeric / haldi\n1 tsp kashmiri red chilli powder / lal mirch powder\n½ tsp coriander powder / daniya powder\n¼ tsp cumin powder / jeera powder\n½ tsp garam masala\n½ tsp kasuri methi / dry fenugreek leaves (crushed)\n½ tsp chaat masala\n1 tsp ginger - garlic paste\n¼ tsp ajwain / carom seeds\n2 tsp besan / gram flour (dry roasted)\n1 tbsp lemon juice\nsalt to taste\n3 tsp oil\n½ onions (petals)\n½ capsicum (red and green, cubed)\n5 cubes paneer / cottage cheese\n",
      "description": "1. Firstly, take ½ cup thick curd / yogurt.\n2. Further add in all the spices along with salt.\n3. Mix till all the spices are combined well with curd.\n4. Now add ½ onion petals, ½ cubed capsicum (red and green) and 5 cubes paneer. Also add 1 tsp of oil.\n5. Mix gently till all the vegetables are coated well.\n6. Furthermore, to marinate, cover and refrigerate for 30 minutes.\n7. After marination, insert the marinated paneer, capsicum and onions into wooden skewers.\n8. Further, roast it on a hot tawa or grill in oven or tandoor.\n9. Finally, sprinkle some chaat masala and serve paneer tikka immediately.\n",
      "image": "image04.jpg"
    },
    {
      "name": "Poori",
      "type": "Vegetarian",
      "ingredients": "2 cup wheat flour\n1 tbsp rava / semolina / suji (fine)\n½ tsp sugar\n½ tsp salt\n2 tsp oil\nwater (for kneading)\noil (for frying)\n",
      "description": "1. Firstly, in a large bowl take 2 cup wheat flour, 1 tbsp rava, ½ tsp sugar, ½ tsp salt and 2 tsp oil.\n2. Crumble and mix well making sure the flour is moist.\n3. Now add water and knead the dough.\n4. Knead the dough tight adding water as required.\n5. Now pinch a large ball size dough and roll to form a log.\n6. Cut into pieces and roll them to small balls.\n7. Place the balls into a small bowl and 1 tsp oil. grease the ball to prevent from drying.\n8. Now take a ball and roll using a rolling pin.\n9. Roll to slightly thick thickness.\n10. Drop the rolled dough into the hot oil.\\n\n11. Press until the puri puffs up and splash oil to puff up fully.\n12. Flip over and fry until it turns golden brown.\n13. Finally, drain off the poori and is ready to enjoy with aloo bhaji.\n",
      "image": "image05.jpg"
    },
    {
      "name": "Masala Soda",
      "type": "Vegetarian",
      "ingredients": "handful mint / pudina\n1 inch ginger\n1 tsp cumin / jeera\n1 tsp chaat masala\n2 tbsp sugar\n3 tbsp lemon juice\n¼ tsp salt\nfew ice cubes\n3 slice lemon\n1 glass soda water (chilled)\n",
      "description": "1. Firstly, in a small blender take handful mint leaves, 1 inch ginger, 1 tsp cumin, 1 tsp chaat masala, 2 tbsp sugar.\n2. Add 3 tbsp lemon juice, ¼ tsp salt and blend to smooth paste.\n3. Take a tbsp of prepared mint masala paste into large glass.\n4. Also add few ice cubes, few mint leaves and 2 slice lemon.\\n\n5. Pour in 1 glass of chilled soda and mix well.\n6. Finally, garnish with a lemon slice and serve limbu masala soda immediately.\n",
      "image": "image06.jpg"
    },
    {
      "name": "Pineapple Mojito",
      "type": "Vegetarian",
      "ingredients": "2 wedges lime\n2 chunks pineapple\n4 mint leaves\n1 ½ ounces pineapple simple syrup, (recipe follows)\nice\nclub soda, (soda water)\npineapple wedges, for garnish (optional)\nPineapple simple syrup:\n1 cup pineapple, chopped (can use a blender)\n2 Tablespoons coconut sugar, (or more, to taste)\n1 cup water\n",
      "description": "To make the pineapple simple syrup:\n1. Simmer the 1 cup chopped pineapple, coconut sugar, and water over medium-low heat, stirring occasionally, for 30 minutes. Add more coconut sugar to achieve desired level of sweetness.\n2. Allow to cool and refrigerate until ready to use.\n\nTo make a mojito:\n1. In a tall glass, add the lime, pineapple chunks, and mint leaves. Muddle a few times to release the flavors.\n2. Add the pineapple simple syrup.\n3. Give it a stir.\\n\n4. Add ice cubes to fill the glass.\n5. Top with club soda.\n6. Garnish with a wedge of pineapple, if desired. Enjoy!\n",
      "image": "image07.jpg"
    },
    {
      "name": "Mango Milkshake",
      "type": "Vegetarian",
      "ingredients": "1 cup mango (cube (fresh / frozen))\n1 tbsp sugar\n2 scoops vanilla ice cream\n½ cup milk (chilled)\nfew nuts (chopped)\n",
      "description": "1. Firstly, in a blender take 1 cup ripened mango.\n2. Also add 1 tbsp sugar and 2 scoops vanilla ice cream.\n3. Blend smooth adding ½ cup chilled milk.\n4. Finally, serve mango milkshake with ice cream topped with few chopped nuts.\n",
      "image": "image08.jpg"
    },
    {
      "name": "Oreo Milkshake",
      "type": "Vegetarian",
      "ingredients": "5 oreo biscuits (vanilla / any flavoured)\n¾ cup full cream milk (cold)\n2-3 scoops vanilla ice cream\n¼ cup whipped cream (optional)\n1 oreo biscuit (crushed)\n",
      "description": "1. Firstly, in a blender take oreo biscuits.\n2. Furthermore, add ¾ to 1 cup of thick cold milk. add more milk if you are looking for thin milk shake.\n3. Also add 2-3 scoops of vanilla ice cream. ice cream helps to make milkshake thick and creamy.\n4. Further, blend to smooth milkshake.\n5. Pour the milkshake into serving glass.\n6. Also top with generous amount of whipped cream.\n7. Finally, serve oreo milk shake garnished with few crushed oreo biscuits.\n",
      "image": "image09.jpg"
    },
    {
      "name": "Masala Lassi",
      "type": "Vegetarian",
      "ingredients": "2 cup curd / yogurt (chilled)\n10 leaves mint / pudina\n1 inch ginger\n¾ tsp cumin powder / jeera powder\n½ tsp pepper (crushed)\n½ tsp salt\n1 cup water (chilled)\n2 piece red-hot charcoal\n¼  tsp cumin / jeera\n¼ tsp  ghee / clarified butter\nfew ice cubes (for serving)\n",
      "description": "1. Firstly, in a blender take 2 cup chilled curd.\n2. Also add 10 leaves mint, 1 inch ginger, ¾ tsp cumin powder, ½ tsp pepper and ½ tsp salt.\n3. Add 1 cup water and blend to thick frothy later on top.\n4. Now place a small cup in the centre and keep 2 pieces of red-hot charcoal.\n5. Add in ¼ tsp cumin and pour ¼ tsp ghee.\n6. Cover with aluminium foil and allow to rest for 2-3 minutes, or till aroma is infused into lassi.\n7. Finally, serve masalaa lassi with few ice cubes garnished with few mint leaves.\n",
      "image": "image010.jpg"
    }
  ]
}